In [1]:
import pandas as pd
data=pd.DataFrame()
print(data)

Empty DataFrame
Columns: []
Index: []

In [2]:
list=["a","b","c","d","e","f"]
print(list)

['a', 'b', 'c', 'd', 'e', 'f']

In [4]:
d=pd.DataFrame(list)
print(d)

   0
0  a
1  b
2  c
3  d
4  e
5  f

In [5]:
d

   0
0  a
1  b
2  c
3  d
4  e
5  f

In [7]:
list1=[[1,2,3,4,5],[6,7,8,9,10]]
d1=pd.DataFrame(list1)
print(d1)

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

In [8]:
d1

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

In [11]:
list3=[[1,2,3,4,5],[6,7,8,9,10],[11,12,13,14,15]]
d2=pd.DataFrame(list3)
print(d2)

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15

In [12]:
d2

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15

In [14]:
dic1={"ID":[1,2,3,4],"Name":["Saira","Zainab","Farhan","Qasim"]}
d3=pd.DataFrame(dic1)
print(d3)

   ID    Name
0   1   Saira
1   2  Zainab
2   3  Farhan
3   4   Qasim

In [15]:
d3

   ID    Name
0   1   Saira
1   2  Zainab
2   3  Farhan
3   4   Qasim

In [19]:
dic2=[{"ID":[1,2,3,4],"Name":["Saira","Zainab","Farhan","Qasim"]},{"ID":[4,5,6,7],"Name":["Saira1","Zainab1","Farhan1","Qasim1"]}]
c=pd.DataFrame(dic2)
print(c)c

             ID                                Name
0  [1, 2, 3, 4]      [Saira, Zainab, Farhan, Qasim]
1  [4, 5, 6, 7]  [Saira1, Zainab1, Farhan1, Qasim1]

In [20]:
c

             ID                                Name
0  [1, 2, 3, 4]      [Saira, Zainab, Farhan, Qasim]
1  [4, 5, 6, 7]  [Saira1, Zainab1, Farhan1, Qasim1]

In [21]:
dic3={"ID":pd.Series([1,2,3,4],index=["a","b","c","d"]),"Name":(["Saira","Zainab","Farhan","Qasim"])}
a=pd.DataFrame(dic3)
print(a)

   ID    Name
a   1   Saira
b   2  Zainab
c   3  Farhan
d   4   Qasim

In [22]:
a

   ID    Name
a   1   Saira
b   2  Zainab
c   3  Farhan
d   4   Qasim

In [5]:
import pandas as pd
data=pd.read_csv("C:\\Users\\Ajwa\\Downloads\\seattle-weather.csv")
print(data)

            date  precipitation  temp_max  temp_min  wind  weather
0     2012-01-01            0.0      12.8       5.0   4.7  drizzle
1     2012-01-02           10.9      10.6       2.8   4.5     rain
2     2012-01-03            0.8      11.7       7.2   2.3     rain
3     2012-01-04           20.3      12.2       5.6   4.7     rain
4     2012-01-05            1.3       8.9       2.8   6.1     rain
...          ...            ...       ...       ...   ...      ...
1456  2015-12-27            8.6       4.4       1.7   2.9     rain
1457  2015-12-28            1.5       5.0       1.7   1.3     rain
1458  2015-12-29            0.0       7.2       0.6   2.6      fog
1459  2015-12-30            0.0       5.6      -1.0   3.4      sun
1460  2015-12-31            0.0       5.6      -2.1   3.5      sun

[1461 rows x 6 columns]

In [6]:
data.head()

         date  precipitation  temp_max  temp_min  wind  weather
0  2012-01-01            0.0      12.8       5.0   4.7  drizzle
1  2012-01-02           10.9      10.6       2.8   4.5     rain
2  2012-01-03            0.8      11.7       7.2   2.3     rain
3  2012-01-04           20.3      12.2       5.6   4.7     rain
4  2012-01-05            1.3       8.9       2.8   6.1     rain

In [7]:
data.tail()

            date  precipitation  temp_max  temp_min  wind weather
1456  2015-12-27            8.6       4.4       1.7   2.9    rain
1457  2015-12-28            1.5       5.0       1.7   1.3    rain
1458  2015-12-29            0.0       7.2       0.6   2.6     fog
1459  2015-12-30            0.0       5.6      -1.0   3.4     sun
1460  2015-12-31            0.0       5.6      -2.1   3.5     sun

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1461 entries, 0 to 1460
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           1461 non-null   object
 1   precipitation  1461 non-null   float64
 2   temp_max       1461 non-null   float64
 3   temp_min       1461 non-null   float64
 4   wind           1461 non-null   float64
 5   weather        1461 non-null   object
dtypes: float64(4), object(2)
memory usage: 68.6+ KB

In [9]:
data.describe()

       precipitation     temp_max     temp_min         wind
count    1461.000000  1461.000000  1461.000000  1461.000000
mean        3.029432    16.439083     8.234771     3.241136
std         6.680194     7.349758     5.023004     1.437825
min         0.000000    -1.600000    -7.100000     0.400000
25%         0.000000    10.600000     4.400000     2.200000
50%         0.000000    15.600000     8.300000     3.000000
75%         2.800000    22.200000    12.200000     4.000000
max        55.900000    35.600000    18.300000     9.500000

In [22]:
data.sample(5)

            date  precipitation  temp_max  temp_min  wind  weather
1263  2015-06-17            0.0      25.0      11.1   3.1      sun
1328  2015-08-21            0.0      22.2      14.4   2.6      sun
207   2012-07-26            0.0      25.6      12.8   2.2  drizzle
120   2012-04-30            4.3      12.8       7.2   8.0     rain
181   2012-06-30            3.0      20.0      13.3   2.4     rain

In [23]:
data[20:31]

          date  precipitation  temp_max  temp_min  wind  weather
20  2012-01-21            3.0       8.3       3.3   8.2     rain
21  2012-01-22            6.1       6.7       2.2   4.8     rain
22  2012-01-23            0.0       8.3       1.1   3.6     rain
23  2012-01-24            8.6      10.0       2.2   5.1     rain
24  2012-01-25            8.1       8.9       4.4   5.4     rain
25  2012-01-26            4.8       8.9       1.1   4.8     rain
26  2012-01-27            0.0       6.7      -2.2   1.4  drizzle
27  2012-01-28            0.0       6.7       0.6   2.2     rain
28  2012-01-29           27.7       9.4       3.9   4.5     rain
29  2012-01-30            3.6       8.3       6.1   5.1     rain
30  2012-01-31            1.8       9.4       6.1   3.9     rain

In [25]:
data[50:56]

          date  precipitation  temp_max  temp_min  wind weather
50  2012-02-20            3.0       7.8       1.7   2.9    rain
51  2012-02-21            0.8      10.0       7.8   7.5    rain
52  2012-02-22            8.6      10.0       2.8   5.9    rain
53  2012-02-23            0.0       8.3       2.8   3.9     sun
54  2012-02-24           11.4       6.7       4.4   3.5    rain
55  2012-02-25            0.0       7.2       2.8   6.4    rain

In [26]:
data.sample(10)

            date  precipitation  temp_max  temp_min  wind  weather
882   2014-06-01            0.0      22.2      10.6   2.3      sun
165   2012-06-14            0.0      17.2      10.0   2.7      sun
1446  2015-12-17           21.8       6.7       3.9   6.0     rain
1281  2015-07-05            0.0      32.8      16.7   2.1      sun
642   2013-10-04            0.0      17.8       5.6   1.1      sun
756   2014-01-26            0.0       8.3       0.6   1.3      sun
221   2012-08-09            0.0      24.4      14.4   3.8  drizzle
224   2012-08-12            0.0      30.6      15.0   3.0      sun
403   2013-02-07            1.3       9.4       3.3   4.1     rain
1016  2014-10-13            7.6      21.1      10.0   3.1     rain

In [30]:
data.shape

(1461, 6)

In [31]:
data.columns

Index(['date', 'precipitation', 'temp_max', 'temp_min', 'wind', 'weather'], dtype='object')

In [32]:
data.index

RangeIndex(start=0, stop=1461, step=1)

In [33]:
data.dtypes

date              object
precipitation    float64
temp_max         float64
temp_min         float64
wind             float64
weather           object
dtype: object

In [34]:
data.sort_values(by="precipitation")

            date  precipitation  temp_max  temp_min  wind weather
1259  2015-06-13            0.0      23.9       9.4   2.6     sun
10    2012-01-11            0.0       6.1      -1.1   5.1     sun
7     2012-01-08            0.0      10.0       2.8   2.0     sun
6     2012-01-07            0.0       7.2       2.8   2.3    rain
27    2012-01-28            0.0       6.7       0.6   2.2    rain
...          ...            ...       ...       ...   ...     ...
794   2014-03-05           46.7      15.6      10.6   3.9    rain
1413  2015-11-14           47.2       9.4       6.1   4.5    rain
323   2012-11-19           54.1      13.3       8.3   6.0    rain
1437  2015-12-08           54.1      15.6      10.0   6.2    rain
1169  2015-03-15           55.9      10.6       6.1   4.2    rain

[1461 rows x 6 columns]

In [35]:
data.isnull()

       date  precipitation  temp_max  temp_min   wind  weather
0     False          False     False     False  False    False
1     False          False     False     False  False    False
2     False          False     False     False  False    False
3     False          False     False     False  False    False
4     False          False     False     False  False    False
...     ...            ...       ...       ...    ...      ...
1456  False          False     False     False  False    False
1457  False          False     False     False  False    False
1458  False          False     False     False  False    False
1459  False          False     False     False  False    False
1460  False          False     False     False  False    False

[1461 rows x 6 columns]

In [41]:
!pip install openpyxl
!pip install xlrd==1.2.0
!pip install xlrd==2.0.1

Requirement already satisfied: openpyxl in c:\users\ajwa\anaconda3\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\ajwa\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Requirement already satisfied: xlrd==1.2.0 in c:\users\ajwa\anaconda3\lib\site-packages (1.2.0)
Collecting xlrd==2.0.1
  Downloading xlrd-2.0.1-py2.py3-none-any.whl.metadata (3.4 kB)
Downloading xlrd-2.0.1-py2.py3-none-any.whl (96 kB)
Installing collected packages: xlrd
  Attempting uninstall: xlrd
    Found existing installation: xlrd 1.2.0
    Uninstalling xlrd-1.2.0:
      Successfully uninstalled xlrd-1.2.0
Successfully installed xlrd-2.0.1

ImportError: Pandas requires version '2.0.1' or newer of 'xlrd' (version '1.2.0' currently installed).

In [45]:
!pip show xlrd

Name: xlrd
Version: 2.0.1
Summary: Library for developers to extract data from Microsoft Excel (tm) .xls spreadsheet files
Home-page: http://www.python-excel.org/
Author: Chris Withers
Author-email: chris@withers.org
License: BSD
Location: C:\Users\Ajwa\anaconda3\Lib\site-packages
Requires:
Required-by:

In [3]:
import pandas as pd
data2=pd.read_excel("C:\\Users\\Ajwa\\Downloads\\file_example_XLS_10.xls")
print(data2)

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468
5  6     Gaston      Brumm    Male  United States   24  21/05/2015  2554
6  7       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
7  8    Earlean     Melgar  Female  United States   27  16/08/2016  2456
8  9   Vincenza    Weiland  Female  United States   40  21/05/2015  6548

In [4]:
data2.head()

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468

In [5]:
data2.tail()

   0 First Name Last Name  Gender        Country  Age        Date    Id
4  5    Nereida   Magwood  Female  United States   58  16/08/2016  2468
5  6     Gaston     Brumm    Male  United States   24  21/05/2015  2554
6  7       Etta      Hurn  Female  Great Britain   56  15/10/2017  3598
7  8    Earlean    Melgar  Female  United States   27  16/08/2016  2456
8  9   Vincenza   Weiland  Female  United States   40  21/05/2015  6548

In [6]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   0           9 non-null      int64
 1   First Name  9 non-null      object
 2   Last Name   9 non-null      object
 3   Gender      9 non-null      object
 4   Country     9 non-null      object
 5   Age         9 non-null      int64
 6   Date        9 non-null      object
 7   Id          9 non-null      int64
dtypes: int64(3), object(5)
memory usage: 708.0+ bytes

In [8]:
data2.describe()

              0        Age           Id
count  9.000000   9.000000     9.000000
mean   5.000000  35.888889  2989.333333
std    2.738613  13.147666  1511.344517
min    1.000000  24.000000  1562.000000
25%    3.000000  25.000000  2456.000000
50%    5.000000  32.000000  2554.000000
75%    7.000000  40.000000  3549.000000
max    9.000000  58.000000  6548.000000

In [9]:
data2.sample()

   0 First Name Last Name  Gender        Country  Age        Date    Id
7  8    Earlean    Melgar  Female  United States   27  16/08/2016  2456

In [10]:
data2.shape

(9, 8)

In [11]:
data2.columns

Index([0, 'First Name', 'Last Name', 'Gender', 'Country', 'Age', 'Date', 'Id'], dtype='object')

In [12]:
data2.index

RangeIndex(start=0, stop=9, step=1)

In [13]:
data2.dtypes

0              int64
First Name    object
Last Name     object
Gender        object
Country       object
Age            int64
Date          object
Id             int64
dtype: object

In [14]:
data2.sort_values(by="Age")

   0 First Name  Last Name  Gender        Country  Age        Date    Id
5  6     Gaston      Brumm    Male  United States   24  21/05/2015  2554
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
7  8    Earlean     Melgar  Female  United States   27  16/08/2016  2456
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
8  9   Vincenza    Weiland  Female  United States   40  21/05/2015  6548
6  7       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468

In [15]:
data2.isnull()

       0  First Name  Last Name  Gender  Country    Age   Date     Id
0  False       False      False   False    False  False  False  False
1  False       False      False   False    False  False  False  False
2  False       False      False   False    False  False  False  False
3  False       False      False   False    False  False  False  False
4  False       False      False   False    False  False  False  False
5  False       False      False   False    False  False  False  False
6  False       False      False   False    False  False  False  False
7  False       False      False   False    False  False  False  False
8  False       False      False   False    False  False  False  False

In [17]:
data3=pd.read_json("C:\\Users\\Ajwa\\Downloads\\sample_data.json")
print(data3)

                                           employees
0     {'name': 'Ali', 'age': 30, 'department': 'HR'}
1    {'name': 'Sara', 'age': 25, 'department': 'IT'}
2  {'name': 'John', 'age': 35, 'department': 'Fin...

In [19]:
data3.head()

                                           employees
0     {'name': 'Ali', 'age': 30, 'department': 'HR'}
1    {'name': 'Sara', 'age': 25, 'department': 'IT'}
2  {'name': 'John', 'age': 35, 'department': 'Fin...

In [21]:
data3.tail()

                                           employees
0     {'name': 'Ali', 'age': 30, 'department': 'HR'}
1    {'name': 'Sara', 'age': 25, 'department': 'IT'}
2  {'name': 'John', 'age': 35, 'department': 'Fin...

In [22]:
data3.sample()

                                           employees
2  {'name': 'John', 'age': 35, 'department': 'Fin...

In [23]:
data3[2:3]

                                           employees
2  {'name': 'John', 'age': 35, 'department': 'Fin...

In [24]:
data3.shape

(3, 1)

In [25]:
data3.columns

Index(['employees'], dtype='object')

In [26]:
data3.index

RangeIndex(start=0, stop=3, step=1)

In [27]:
data3.dtypes

employees    object
dtype: object

In [29]:
data3.isnull()

   employees
0      False
1      False
2      False

In [33]:
import sqlite3
conn=sqlite3.connect("C:\\Users\\Ajwa\\Downloads\\sample_large.db")
data4=pd.read_sql("SELECT * FROM employees",conn)
print(data4)

     id    name department    salary joining_date
0     1    Emma         HR  41151.84   2023-02-11
1     2    John         IT  60397.27   2020-06-24
2     3    Emma  Marketing  34044.20   2021-03-28
3     4    John         HR  60711.62   2023-12-25
4     5    Nina         HR  51079.30   2021-10-25
..  ...     ...        ...       ...          ...
95   96    Nina    Finance  44892.73   2021-08-10
96   97  Khalid         IT  38973.97   2024-02-07
97   98  Ayesha  Marketing  73843.85   2022-06-06
98   99  Khalid  Marketing  33725.61   2024-02-13
99  100    Sara         HR  56319.88   2023-12-22

[100 rows x 5 columns]

In [34]:
data4.head()

   id  name department    salary joining_date
0   1  Emma         HR  41151.84   2023-02-11
1   2  John         IT  60397.27   2020-06-24
2   3  Emma  Marketing  34044.20   2021-03-28
3   4  John         HR  60711.62   2023-12-25
4   5  Nina         HR  51079.30   2021-10-25

In [35]:
data4.tail()

     id    name department    salary joining_date
95   96    Nina    Finance  44892.73   2021-08-10
96   97  Khalid         IT  38973.97   2024-02-07
97   98  Ayesha  Marketing  73843.85   2022-06-06
98   99  Khalid  Marketing  33725.61   2024-02-13
99  100    Sara         HR  56319.88   2023-12-22

In [36]:
data4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            100 non-null    int64
 1   name          100 non-null    object
 2   department    100 non-null    object
 3   salary        100 non-null    float64
 4   joining_date  100 non-null    object
dtypes: float64(1), int64(1), object(3)
memory usage: 4.0+ KB

In [37]:
data4.describe()

               id        salary
count  100.000000    100.000000
mean    50.500000  60725.935900
std     29.011492  17410.970779
min      1.000000  30124.220000
25%     25.750000  45632.432500
50%     50.500000  60216.975000
75%     75.250000  75560.472500
max    100.000000  89752.570000

In [38]:
data4.sample()

    id  name department    salary joining_date
24  25  Nina         IT  71345.21   2022-10-16

In [39]:
data4.sample(5)

    id    name department    salary joining_date
78  79    Sara  Marketing  46541.44   2020-02-15
56  57  Sophia    Finance  84096.56   2024-11-01
66  67  Khalid         HR  75534.48   2022-04-15
50  51  Khalid    Finance  68560.09   2021-03-07
19  20     Ali         HR  79048.77   2021-10-25

In [40]:
data4.shape

(100, 5)

In [41]:
data4.columns

Index(['id', 'name', 'department', 'salary', 'joining_date'], dtype='object')

In [42]:
data4.index

RangeIndex(start=0, stop=100, step=1)

In [43]:
data4.dtypes

id                int64
name             object
department       object
salary          float64
joining_date     object
dtype: object

In [44]:
data4.sort_values(by="salary")

    id    name department    salary joining_date
84  85  Ayesha         IT  30124.22   2023-03-14
88  89    Omar      Sales  30531.76   2023-03-06
67  68    Sara  Marketing  31374.94   2020-07-13
27  28  Sophia  Marketing  32207.91   2020-01-27
68  69    John      Sales  32892.16   2020-07-09
..  ..     ...        ...       ...          ...
16  17    Nina         IT  87415.42   2021-05-17
32  33    John  Marketing  88243.39   2023-01-22
63  64     Ali    Finance  88546.04   2023-11-10
81  82    Nina    Finance  89093.20   2021-10-20
71  72    Sara      Sales  89752.57   2022-08-28

[100 rows x 5 columns]

In [45]:
data5=pd.read_html("C:\\Users\\Ajwa\\Downloads\\sample_tables.html")
print(data5)

[   ID    Name Department  Salary
0   1     Ali         HR   50000
1   2    Sara         IT   65000
2   3  Farhan    Finance   72000
3   4  Zainab  Marketing   60000,   Month Region  Revenue
0   Jan  North   120000
1   Feb  South    95000
2   Mar   East   110000]

In [50]:
data5[0].head()
data5[0].sample(2)
data5[0].shape

(4, 4)

In [48]:
data5[1].head()

  Month Region  Revenue
0   Jan  North   120000
1   Feb  South    95000
2   Mar   East   110000

                                                     import    pandas    as  \
df_clip        =   pd.read_clipboard() #   Clipboard     se  directly  read
print(df_clip) NaN NaN                 NaN NaN         None      None  None

                                                          pd
df_clip        =   pd.read_clipboard() #   Clipboard  karega
print(df_clip) NaN NaN                 NaN NaN          None

In [ ]:
ID,Name,Department,Salary
1,Ali,HR,50000
2,Sara,IT,65000
3,Farhan,Finance,72000
4,Zainab,Marketing,60000

In [52]:
data5=pd.read_clipboard()
print(data5)

  ID,Name,Department,Salary
0            1,Ali,HR,50000
1           2,Sara,IT,65000
2    3,Farhan,Finance,72000
3  4,Zainab,Marketing,60000

In [53]:
Month	Region	Revenue
0	Jan	North	120000
1	Feb	South	95000
2	Mar	East	110000

SyntaxError: invalid syntax (2406607889.py, line 1)

In [ ]:
Month	Region	Revenue
0	Jan	North	120000
1	Feb	South	95000
2	Mar	East	110000

In [3]:
data6=pd.read_clipboard()
print(data6)

  Month Region  Revenue
0   Jan  North   120000
1   Feb  South    95000
2   Mar   East   110000

In [ ]:
                                                           # Data Exploration:

In [4]:
data=pd.read_csv("C:\\Users\\Ajwa\\Downloads\\seattle-weather.csv")
print(data)

            date  precipitation  temp_max  temp_min  wind  weather
0     2012-01-01            0.0      12.8       5.0   4.7  drizzle
1     2012-01-02           10.9      10.6       2.8   4.5     rain
2     2012-01-03            0.8      11.7       7.2   2.3     rain
3     2012-01-04           20.3      12.2       5.6   4.7     rain
4     2012-01-05            1.3       8.9       2.8   6.1     rain
...          ...            ...       ...       ...   ...      ...
1456  2015-12-27            8.6       4.4       1.7   2.9     rain
1457  2015-12-28            1.5       5.0       1.7   1.3     rain
1458  2015-12-29            0.0       7.2       0.6   2.6      fog
1459  2015-12-30            0.0       5.6      -1.0   3.4      sun
1460  2015-12-31            0.0       5.6      -2.1   3.5      sun

[1461 rows x 6 columns]

In [5]:
type(data)

pandas.core.frame.DataFrame

In [6]:
data.columns

Index(['date', 'precipitation', 'temp_max', 'temp_min', 'wind', 'weather'], dtype='object')

In [7]:
data=pd.read_csv("C:\\Users\\Ajwa\\Downloads\\seattle-weather.csv",nrows=15)
print(data)

          date  precipitation  temp_max  temp_min  wind  weather
0   2012-01-01            0.0      12.8       5.0   4.7  drizzle
1   2012-01-02           10.9      10.6       2.8   4.5     rain
2   2012-01-03            0.8      11.7       7.2   2.3     rain
3   2012-01-04           20.3      12.2       5.6   4.7     rain
4   2012-01-05            1.3       8.9       2.8   6.1     rain
5   2012-01-06            2.5       4.4       2.2   2.2     rain
6   2012-01-07            0.0       7.2       2.8   2.3     rain
7   2012-01-08            0.0      10.0       2.8   2.0      sun
8   2012-01-09            4.3       9.4       5.0   3.4     rain
9   2012-01-10            1.0       6.1       0.6   3.4     rain
10  2012-01-11            0.0       6.1      -1.1   5.1      sun
11  2012-01-12            0.0       6.1      -1.7   1.9      sun
12  2012-01-13            0.0       5.0      -2.8   1.3      sun
13  2012-01-14            4.1       4.4       0.6   5.3     snow
14  2012-01-15            5.3       1.1      -3.3   3.2     snow

In [8]:
data=pd.read_csv("C:\\Users\\Ajwa\\Downloads\\seattle-weather.csv",nrows=15,usecols=[0,1,5])
print(data)

          date  precipitation  weather
0   2012-01-01            0.0  drizzle
1   2012-01-02           10.9     rain
2   2012-01-03            0.8     rain
3   2012-01-04           20.3     rain
4   2012-01-05            1.3     rain
5   2012-01-06            2.5     rain
6   2012-01-07            0.0     rain
7   2012-01-08            0.0      sun
8   2012-01-09            4.3     rain
9   2012-01-10            1.0     rain
10  2012-01-11            0.0      sun
11  2012-01-12            0.0      sun
12  2012-01-13            0.0      sun
13  2012-01-14            4.1     snow
14  2012-01-15            5.3     snow

In [15]:
data=pd.read_csv("C:\\Users\\Ajwa\\Downloads\\seattle-weather.csv",nrows=10,index_col='temp_max')
print(data)

                date  precipitation  temp_min  wind  weather
temp_max
12.8      2012-01-01            0.0       5.0   4.7  drizzle
10.6      2012-01-02           10.9       2.8   4.5     rain
11.7      2012-01-03            0.8       7.2   2.3     rain
12.2      2012-01-04           20.3       5.6   4.7     rain
8.9       2012-01-05            1.3       2.8   6.1     rain
4.4       2012-01-06            2.5       2.2   2.2     rain
7.2       2012-01-07            0.0       2.8   2.3     rain
10.0      2012-01-08            0.0       2.8   2.0      sun
9.4       2012-01-09            4.3       5.0   3.4     rain
6.1       2012-01-10            1.0       0.6   3.4     rain

In [16]:
data=pd.read_csv("C:\\Users\\Ajwa\\Downloads\\seattle-weather.csv",nrows=10,index_col=[0,1,2])
print(data)

                                   temp_min  wind  weather
date       precipitation temp_max
2012-01-01 0.0           12.8           5.0   4.7  drizzle
2012-01-02 10.9          10.6           2.8   4.5     rain
2012-01-03 0.8           11.7           7.2   2.3     rain
2012-01-04 20.3          12.2           5.6   4.7     rain
2012-01-05 1.3           8.9            2.8   6.1     rain
2012-01-06 2.5           4.4            2.2   2.2     rain
2012-01-07 0.0           7.2            2.8   2.3     rain
2012-01-08 0.0           10.0           2.8   2.0      sun
2012-01-09 4.3           9.4            5.0   3.4     rain
2012-01-10 1.0           6.1            0.6   3.4     rain

In [17]:
data=pd.read_csv("C:\\Users\\Ajwa\\Downloads\\seattle-weather.csv",nrows=10,header=1)
print(data)

   2012-01-01   0.0  12.8  5.0  4.7 drizzle
0  2012-01-02  10.9  10.6  2.8  4.5    rain
1  2012-01-03   0.8  11.7  7.2  2.3    rain
2  2012-01-04  20.3  12.2  5.6  4.7    rain
3  2012-01-05   1.3   8.9  2.8  6.1    rain
4  2012-01-06   2.5   4.4  2.2  2.2    rain
5  2012-01-07   0.0   7.2  2.8  2.3    rain
6  2012-01-08   0.0  10.0  2.8  2.0     sun
7  2012-01-09   4.3   9.4  5.0  3.4    rain
8  2012-01-10   1.0   6.1  0.6  3.4    rain
9  2012-01-11   0.0   6.1 -1.1  5.1     sun

In [18]:
data=pd.read_csv("C:\\Users\\Ajwa\\Downloads\\seattle-weather.csv",nrows=10)
print(data)

         date  precipitation  temp_max  temp_min  wind  weather
0  2012-01-01            0.0      12.8       5.0   4.7  drizzle
1  2012-01-02           10.9      10.6       2.8   4.5     rain
2  2012-01-03            0.8      11.7       7.2   2.3     rain
3  2012-01-04           20.3      12.2       5.6   4.7     rain
4  2012-01-05            1.3       8.9       2.8   6.1     rain
5  2012-01-06            2.5       4.4       2.2   2.2     rain
6  2012-01-07            0.0       7.2       2.8   2.3     rain
7  2012-01-08            0.0      10.0       2.8   2.0      sun
8  2012-01-09            4.3       9.4       5.0   3.4     rain
9  2012-01-10            1.0       6.1       0.6   3.4     rain

In [21]:
data=pd.read_csv("C:\\Users\\Ajwa\\Downloads\\seattle-weather.csv",nrows=10,header=2)
print(data)

   2012-01-02  10.9  10.6  2.8  4.5  rain
0  2012-01-03   0.8  11.7  7.2  2.3  rain
1  2012-01-04  20.3  12.2  5.6  4.7  rain
2  2012-01-05   1.3   8.9  2.8  6.1  rain
3  2012-01-06   2.5   4.4  2.2  2.2  rain
4  2012-01-07   0.0   7.2  2.8  2.3  rain
5  2012-01-08   0.0  10.0  2.8  2.0   sun
6  2012-01-09   4.3   9.4  5.0  3.4  rain
7  2012-01-10   1.0   6.1  0.6  3.4  rain
8  2012-01-11   0.0   6.1 -1.1  5.1   sun
9  2012-01-12   0.0   6.1 -1.7  1.9   sun

In [26]:
data=pd.read_csv("C:\\Users\\Ajwa\\Downloads\\seattle-weather.csv",nrows=10,header=None,skiprows=0)
print(data)

            0              1         2         3     4        5
0        date  precipitation  temp_max  temp_min  wind  weather
1  2012-01-01            0.0      12.8       5.0   4.7  drizzle
2  2012-01-02           10.9      10.6       2.8   4.5     rain
3  2012-01-03            0.8      11.7       7.2   2.3     rain
4  2012-01-04           20.3      12.2       5.6   4.7     rain
5  2012-01-05            1.3       8.9       2.8   6.1     rain
6  2012-01-06            2.5       4.4       2.2   2.2     rain
7  2012-01-07            0.0       7.2       2.8   2.3     rain
8  2012-01-08            0.0      10.0       2.8   2.0      sun
9  2012-01-09            4.3       9.4       5.0   3.4     rain

In [29]:
data=pd.read_csv("C:\\Users\\Ajwa\\Downloads\\seattle-weather.csv",nrows=10,header=None,prefix="Columns")
print(data)

TypeError: read_csv() got an unexpected keyword argument 'prefix'

In [31]:
data=pd.read_csv("C:\\Users\\Ajwa\\Downloads\\seattle-weather.csv",nrows=10,usecols=[0,1,2,3,4],names=["A","B","C","D","E"])
print(data)

            A              B         C         D     E
0        date  precipitation  temp_max  temp_min  wind
1  2012-01-01            0.0      12.8       5.0   4.7
2  2012-01-02           10.9      10.6       2.8   4.5
3  2012-01-03            0.8      11.7       7.2   2.3
4  2012-01-04           20.3      12.2       5.6   4.7
5  2012-01-05            1.3       8.9       2.8   6.1
6  2012-01-06            2.5       4.4       2.2   2.2
7  2012-01-07            0.0       7.2       2.8   2.3
8  2012-01-08            0.0      10.0       2.8   2.0
9  2012-01-09            4.3       9.4       5.0   3.4

In [32]:
data=pd.read_csv("C:\\Users\\Ajwa\\Downloads\\seattle-weather.csv")
print(data)

            date  precipitation  temp_max  temp_min  wind  weather
0     2012-01-01            0.0      12.8       5.0   4.7  drizzle
1     2012-01-02           10.9      10.6       2.8   4.5     rain
2     2012-01-03            0.8      11.7       7.2   2.3     rain
3     2012-01-04           20.3      12.2       5.6   4.7     rain
4     2012-01-05            1.3       8.9       2.8   6.1     rain
...          ...            ...       ...       ...   ...      ...
1456  2015-12-27            8.6       4.4       1.7   2.9     rain
1457  2015-12-28            1.5       5.0       1.7   1.3     rain
1458  2015-12-29            0.0       7.2       0.6   2.6      fog
1459  2015-12-30            0.0       5.6      -1.0   3.4      sun
1460  2015-12-31            0.0       5.6      -2.1   3.5      sun

[1461 rows x 6 columns]

In [33]:
data = pd.DataFrame({
    'City': ['Seattle', 'Seattle', 'Austin', 'Austin', 'Seattle'],
    'Temp': [10, 12, 20, 22, 14],
    'Rain': [5, 7, 0, 1, 8]
})
print(data)

      City  Temp  Rain
0  Seattle    10     5
1  Seattle    12     7
2   Austin    20     0
3   Austin    22     1
4  Seattle    14     8

In [34]:
data

      City  Temp  Rain
0  Seattle    10     5
1  Seattle    12     7
2   Austin    20     0
3   Austin    22     1
4  Seattle    14     8

In [86]:


import pandas as pd

data = pd.DataFrame({
    'City': ['Seattle','Seattle','Austin','Austin','Seattle'],
    'Temp': [10,12,20,22,14],
    'Rain': [5,7,0,1,8]
})
print(data.groupby("City")["Rain"])

print(data.groupby("City")["Rain"].agg(["mean","min","max","count"]))

<pandas.core.groupby.generic.SeriesGroupBy object at 0x000001B0FC78BBF0>
             mean  min  max  count
City
Austin   0.500000    0    1      2
Seattle  6.666667    5    8      3

In [37]:
df = pd.DataFrame({
    'item': ['A','B','C','D','E'],
    'price': [10,20,10,30,20],
    'quantity': [2,5,3,1,4]
})
g1=df.groupby(by="price")
g1

In [39]:
g1.groups

{10: [0, 2], 20: [1, 4], 30: [3]}

In [43]:
df.groupby(["price","quantity"]).groups

{(10, 2): [0], (10, 3): [2], (20, 4): [4], (20, 5): [1], (30, 1): [3]}

In [46]:
df.groupby(["price","item"]).groups

{(10, 'A'): [0], (10, 'C'): [2], (20, 'B'): [1], (20, 'E'): [4], (30, 'D'): [3]}

In [49]:
for price, df_1 in g1:
    print("Group:", price)
    print(df_1)

Group: 10
  item  price  quantity
0    A     10         2
2    C     10         3
Group: 20
  item  price  quantity
1    B     20         5
4    E     20         4
Group: 30
  item  price  quantity
3    D     30         1

In [50]:
g2=df.groupby(by="quantity")
print(g2)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001B081593150>

In [51]:
g2.groups

{1: [3], 2: [0], 3: [2], 4: [4], 5: [1]}

In [55]:
for quantity, df_2 in g2:
    print("Group:", quantity)
    print(df_2)

Group: 1
  item  price  quantity
3    D     30         1
Group: 2
  item  price  quantity
0    A     10         2
Group: 3
  item  price  quantity
2    C     10         3
Group: 4
  item  price  quantity
4    E     20         4
Group: 5
  item  price  quantity
1    B     20         5

In [56]:
list(g1)

[(10,
    item  price  quantity
  0    A     10         2
  2    C     10         3),
 (20,
    item  price  quantity
  1    B     20         5
  4    E     20         4),
 (30,
    item  price  quantity
  3    D     30         1)]

In [57]:
list(g2)

[(1,
    item  price  quantity
  3    D     30         1),
 (2,
    item  price  quantity
  0    A     10         2),
 (3,
    item  price  quantity
  2    C     10         3),
 (4,
    item  price  quantity
  4    E     20         4),
 (5,
    item  price  quantity
  1    B     20         5)]

In [59]:
dict(list(g1))

{10:   item  price  quantity
 0    A     10         2
 2    C     10         3,
 20:   item  price  quantity
 1    B     20         5
 4    E     20         4,
 30:   item  price  quantity
 3    D     30         1}

In [60]:
df

  item  price  quantity
0    A     10         2
1    B     20         5
2    C     10         3
3    D     30         1
4    E     20         4

In [61]:
g3=df.groupby("price").get_group(10)
g3

  item  price  quantity
0    A     10         2
2    C     10         3

In [62]:
g3.sum()

item        AC
price       20
quantity     5
dtype: object

In [63]:
g3.agg(["sum","max","min"])

    item  price  quantity
sum   AC     20         5
max    C     10         3
min    A     10         2

In [64]:
g1.agg(["sum","max","min"])

      item         quantity
       sum max min      sum max min
price
10      AC   C   A        5   3   2
20      BE   E   B        9   5   4
30       D   D   D        1   1   1

In [65]:
data=pd.read_csv("C:\\Users\\Ajwa\\Downloads\\seattle-weather.csv")
print(data)

            date  precipitation  temp_max  temp_min  wind  weather
0     2012-01-01            0.0      12.8       5.0   4.7  drizzle
1     2012-01-02           10.9      10.6       2.8   4.5     rain
2     2012-01-03            0.8      11.7       7.2   2.3     rain
3     2012-01-04           20.3      12.2       5.6   4.7     rain
4     2012-01-05            1.3       8.9       2.8   6.1     rain
...          ...            ...       ...       ...   ...      ...
1456  2015-12-27            8.6       4.4       1.7   2.9     rain
1457  2015-12-28            1.5       5.0       1.7   1.3     rain
1458  2015-12-29            0.0       7.2       0.6   2.6      fog
1459  2015-12-30            0.0       5.6      -1.0   3.4      sun
1460  2015-12-31            0.0       5.6      -2.1   3.5      sun

[1461 rows x 6 columns]

In [69]:
print(data.loc[0])

date             2012-01-01
precipitation           0.0
temp_max               12.8
temp_min                5.0
wind                    4.7
weather             drizzle
Name: 0, dtype: object

In [70]:
print(data.loc[0,"date"])

2012-01-01

In [71]:
print(data.loc[[0]])

         date  precipitation  temp_max  temp_min  wind  weather
0  2012-01-01            0.0      12.8       5.0   4.7  drizzle

In [74]:
print(data.iloc[[1]])

         date  precipitation  temp_max  temp_min  wind weather
1  2012-01-02           10.9      10.6       2.8   4.5    rain

In [75]:
import pandas as pd

df = pd.DataFrame({
    'City': ['Seattle','Austin','Boston'],
    'Temp': [12, 22, 15]
}, index=['a','b','c'])

print(df)

      City  Temp
a  Seattle    12
b   Austin    22
c   Boston    15

In [2]:
#print(df.iloc[0])
print(df.loc(0))

NameError: name 'df' is not defined

In [3]:
import pandas as pd

df = pd.DataFrame({
    'City': ['Seattle','Austin','Boston'],
    'Temp': [12, 22, 15]
}, index=['a','b','c'])

print(df)

      City  Temp
a  Seattle    12
b   Austin    22
c   Boston    15

In [4]:
df[df["Temp"]>12]

     City  Temp
b  Austin    22
c  Boston    15

In [3]:
import pandas as pd

df = pd.DataFrame({
    'City': ['Seattle','Austin','Boston'],
    'Temp': [12, 22, 15]
}, index=['a','b','c'])

print(df)

      City  Temp
a  Seattle    12
b   Austin    22
c   Boston    15

In [9]:
#df.iloc("a")
print(df.loc["a"])

City    Seattle
Temp         12
Name: a, dtype: object

In [10]:
df.iloc["a"]

TypeError: Cannot index by location index with a non-integer key